schreibfaul1/ESP32-audioI2S/src/Audio.h
    // Request memory for an array of T
    template <typename T>
    std::unique_ptr<T[], PsramDeleter> audio_malloc(std::size_t count) {
        T* raw = static_cast<T*>(ps_malloc(sizeof(T) * count));
        if (!raw) {
            log_e("audio_malloc_array: OOM, no space for %zu bytes", sizeof(T) * count);
        }
        return std::unique_ptr<T[], PsramDeleter>(raw);
    }

    // Copies raw data into a Unique_PTR goal (e.g. like memcpy)
    template <typename T>
    void audio_memcpy(std::unique_ptr<T[]>& dest, const T* src, std::size_t count) {
        static_assert(std::is_trivially_copyable<T>::value, "T must be trivially copyable");
        if (dest && src && count > 0) {
            memcpy(dest.get(), src, count * sizeof(T));
        }
    }


    std::unique_ptr<char[], PsramDeleter> audio_strdup(const char* str) {
        if (!str) {
            log_e("audio_strdup: input str is NULL");
            return nullptr;
        }

        size_t len = strlen(str);
        auto ps_str = audio_malloc<char>(len + 1);

        if (!ps_str) {
            log_e("audio_strdup: OOM, no space for %zu bytes", len + 1);
            return nullptr;
        }

        strcpy(ps_str.get(), str);
        return ps_str;
    }

    std::unique_ptr<char[], PsramDeleter> audio_strndup(const char* str, size_t maxlen) {
        if (!str) {
            log_e("audio_strndup: input str is NULL");
            return nullptr;
        }

        // Effektive Länge der zu kopierenden Zeichen (nicht mehr als maxlen, nicht über das Ende hinaus)
        size_t len = strnlen(str, maxlen);

        // Speicher reservieren (+1 für Nullterminierung)
        auto ps_str = audio_malloc<char>(len + 1);

        if (!ps_str) {
            log_e("audio_strndup: OOM, no space for %zu bytes", len + 1);
            return nullptr;
        }

        // Sicher kopieren (genau len Zeichen)
        memcpy(ps_str.get(), str, len);
        ps_str[len] = '\0'; // Nullterminierung hinzufügen

        return ps_str;
    }

//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
    ps_ptr<char> urlencode(const char* str, bool spacesOnly) {
        if (!str) {return nullptr;}  // Enter is zero

        // Reserve memory for the result (3x the length of the input string, worst-case)
        size_t inputLength = strlen(str);
        size_t bufferSize = inputLength * 3 + 1; // Worst-case-Szenario
        auto encoded = audio_malloc<char>(bufferSize);
        if (!encoded) {return nullptr; } // memory allocation failed

        const char *p_input = str;  // Copy of the input pointer
        char *p_encoded = encoded.get();  // pointer of the output buffer
        size_t remainingSpace = bufferSize; // remaining space in the output buffer

        while (*p_input) {
            if (isalnum((unsigned char)*p_input)) {
                // adopt alphanumeric characters directly
                if (remainingSpace > 1) {
                    *p_encoded++ = *p_input;
                    remainingSpace--;
                } else {
                    return nullptr; // security check failed
                }
            } else if (spacesOnly && *p_input != 0x20) {
                // Nur Leerzeichen nicht kodieren
                if (remainingSpace > 1) {
                    *p_encoded++ = *p_input;
                    remainingSpace--;
                } else {
                    return nullptr; // security check failed
                }
            } else {
                // encode unsafe characters as '%XX'
                if (remainingSpace > 3) {
                    int written = snprintf(p_encoded, remainingSpace, "%%%02X", (unsigned char)*p_input);
                    if (written < 0 || written >= (int)remainingSpace) {
                        return nullptr; // error writing to buffer
                    }
                    p_encoded += written;
                    remainingSpace -= written;
                } else {
                    return nullptr; // security check failed
                }
            }
            p_input++;
        }

        // Null-terminieren
        if (remainingSpace > 0) {
            *p_encoded = '\0';
        } else {
            return nullptr; // security check failed
        }

        return encoded;
    }
//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
// Function to reverse the byte order of a 32-bit value (big-endian to little-endian)
    uint32_t bswap32(uint32_t x) {
        return ((x & 0xFF000000) >> 24) |
               ((x & 0x00FF0000) >> 8)  |
               ((x & 0x0000FF00) << 8)  |
               ((x & 0x000000FF) << 24);
    }
//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
// Function to reverse the byte order of a 64-bit value (big-endian to little-endian)
    uint64_t bswap64(uint64_t x) {
        return ((x & 0xFF00000000000000ULL) >> 56) |
               ((x & 0x00FF000000000000ULL) >> 40) |
               ((x & 0x0000FF0000000000ULL) >> 24) |
               ((x & 0x000000FF00000000ULL) >> 8)  |
               ((x & 0x00000000FF000000ULL) << 8)  |
               ((x & 0x0000000000FF0000ULL) << 24) |
               ((x & 0x000000000000FF00ULL) << 40) |
               ((x & 0x00000000000000FFULL) << 56);
    }
//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————



private:
    const char *codecname[10] = {"unknown", "WAV", "MP3", "AAC", "M4A", "FLAC", "AACP", "OPUS", "OGG", "VORBIS" };
    enum : int { APLL_AUTO = -1, APLL_ENABLE = 1, APLL_DISABLE = 0 };
    enum : int { EXTERNAL_I2S = 0, INTERNAL_DAC = 1, INTERNAL_PDM = 2 };
    enum : int { FORMAT_NONE = 0, FORMAT_M3U = 1, FORMAT_PLS = 2, FORMAT_ASX = 3, FORMAT_M3U8 = 4}; // playlist formats
    enum : int { AUDIO_NONE, HTTP_RESPONSE_HEADER, AUDIO_DATA, AUDIO_LOCALFILE,
                 AUDIO_PLAYLISTINIT, AUDIO_PLAYLISTHEADER,  AUDIO_PLAYLISTDATA};
    enum : int { FLAC_BEGIN = 0, FLAC_MAGIC = 1, FLAC_MBH =2, FLAC_SINFO = 3, FLAC_PADDING = 4, FLAC_APP = 5,
                 FLAC_SEEK = 6, FLAC_VORBIS = 7, FLAC_CUESHEET = 8, FLAC_PICTURE = 9, FLAC_OKAY = 100};
    enum : int { M4A_BEGIN = 0, M4A_FTYP = 1, M4A_CHK = 2, M4A_MOOV = 3, M4A_FREE = 4, M4A_TRAK = 5, M4A_MDAT = 6,
                 M4A_ILST = 7, M4A_MP4A = 8, M4A_AMRDY = 99, M4A_OKAY = 100};
    enum : int { CODEC_NONE = 0, CODEC_WAV = 1, CODEC_MP3 = 2, CODEC_AAC = 3, CODEC_M4A = 4, CODEC_FLAC = 5,
                 CODEC_AACP = 6, CODEC_OPUS = 7, CODEC_OGG = 8, CODEC_VORBIS = 9};
    enum : int { ST_NONE = 0, ST_WEBFILE = 1, ST_WEBSTREAM = 2};
    typedef enum { LEFTCHANNEL=0, RIGHTCHANNEL=1 } SampleIndex;
    typedef enum { LOWSHELF = 0, PEAKEQ = 1, HIFGSHELF =2 } FilterType;

